{
  "07_26_25.gpx": {
    "name": "Westfjords Day 1",
    "desc": "Description..."
  },
  "07_27_25.gpx": {
    "name": "Westfjords Day 2",
    "desc": "Description..."
  },
  "07_28_25.gpx": {
    "name": "Westfjords Day 3",
    "desc": "Description..."
  },
  "07_29_25.gpx": {
    "name": "Westfjords Day 4",
    "desc": "Description..."
  },
  "07_30_25.gpx": {
    "name": "Westfjords Day 5",
    "desc": "Description..."
  },
  "07_31_25 2.gpx": {
    "name": "Westfjords Day 5 (finding camp)",
    "desc": "Description..."
  },
  "07_31_25.gpx": {
    "name": "Westfjords Day 6",
    "desc": "Description..."
  },
  "08_01_25.gpx": {
    "name": "Westfjords Day 7",
    "desc": "Description..."
  },
  "29_10_2025 Putney -- Surry Hills.gpx": {
    "name": "29/10/25 Putney -> Surry Hills",
    "desc": "Bit of a late start out of London but good to make some ground towards Portsmouth - we got a ferry to catch! Richmond Park was a lovely route out of the city. As usual getting on the bike makes all the fuss worthwhile :)"
  },
  "30/10/25 Surry Hills -> Portsmouth.gpx": {
    "name": "30/10/2025 Surry Hills -> Portsmouth",
    "desc": "A frosty morning, but a lovely start through some leafy trails. Then much of the day on quiet winding backroads through the South Downs National Park, until the industrial reaches of Portsmouth (good cycling infrastructure beside much of the freeway though). Arrived with plenty of time to spare. Free pastries from the Yew Tree cafe in Goldaming was a treat."
  },
  "01_11_2025 El Puerto de Bilbao -- up the hill from Elaxalde.gpx": {
    "name": "01/11/2025 El Puerto de Bilbao -> up the hill from Elaxalde",
    "desc": "Rolled off the ferry and into Santurzti for a long coffee break to get reacquainted with solid ground 🤢 Then meandered upriver enjoying Bilbao’s vibe. The climb straight out of (Plaza Nueva?) came as a shock with our route sending us up some 20% alleys on el Camindo de Santiago (northern route). Then the wet set in, and when the dark did too we pulled up short for the night beside a council water pumping station in some hills (hoping this won’t offend anyone (Basques). Following Vuelta de Vasco for a few days:
https://bikepacking.com/routes/basque-bikepacking-vuelta-de-vasco/",
  },
  "02_11_2025 Elaxalde -- Mutriku.gpx": {
    "name": "02/11/2025 Elaxalde -> Mutriku",
    "desc": "After a bit of slipping and sliding in the mud, bailing on to the very pleasant roads with all the other cyclists was a great idea. As was coffee and pintxos at the first cafe en route in Guernica. A very pleasant day of road riding followed, through ever-more picturesque coastal Basque towns."
  },
  "04_11_2025 Mutriku -- Donastia / San Sebastián.gpx": {
    "name": "04/11/2025 Mutriku -> Donastia / San Sebastián",
    "desc": "A mere 4km before coffee and treats - getting used to this. More coastal roads, more pretty coastal towns, some silly hike-a-bike in the route that we’re going to try to forget. The high ridge of Mt Igeldo after dark was atmospheric before dropping into Donastia / San Sebastián."
  },
  "06_11_2025 Donastia -- Leitzaran valley.gpx": {
    "name": "06/11/2025 Donastia -> Leitzaran valley",
    "desc": "Just an arvo session rolling out of Donastia / San Sebastián, then onto a lovely vias verdes, i.e. rail trail, for a pleasant, gentle climb along the Leitzaran river. A disused train tunnel made for a welcome camp out of the rain."
  },
  "07_11_2025 Leitzaran valley -- Aralar Range.gpx": {
    "name": "07/11/2025 Leitzaran valley -> Aralar Range",
    "desc": ""
  },
  "09_11_2025 Aralar Range -- Ubasa Plateau.gpx": {
    "name": "09/11/2025 Aralar Range -> Ubasa Plateau",
    "desc": ""
  },
  "10_11_2025 Ubasa Plateau -- Larraona.gpx": {
    "name": "10/11/2025 Ubasa Plateau -> Larraona",
    "desc": ""
  },
  "12_11_2025 Larraona -> Logroño.gpx": {
    "name": "12/11/2025 Larraona -> Logroño",
    "desc": ""
  }
}